/*
    Задан следующий трехмерный массив
    С помощью циклов переберите все элементы этого массива и выведите их на консоль в следующем виде:
    {{{1 , 2} , {3 , 4}} , {{4 , 5} , {6 , 7}} , {{7 , 8}, {9 , 10}} , {{10 , 11} , {12 , 13}}}
*/

using System;

namespace ArraySort
{
    
    class program
    {
        
        static void Main(string[] args)
        {
            
            int[,,] Mas = { { { 1, 2 },{ 3, 4 } },
                { { 4, 5 }, { 6, 7 } },
                { { 7, 8 }, { 9, 10 } },
                { { 10, 11 }, { 12, 13 } }
              };

        }
        
    }
    
}
